; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l9_p9_c9_g9)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 medicina)
	(at-box box9 deposito)
	(box-has box9 medicina)
	(at-person person1 refugio5)
	(at-person person2 refugio1)
	(at-person person3 refugio9)
	(at-person person4 refugio4)
	(at-person person5 refugio1)
	(at-person person6 refugio2)
	(at-person person7 refugio6)
	(at-person person8 refugio8)
	(at-person person9 refugio1)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person3 medicina)
	(person-has person5 comida)
	(person-has person6 comida)
	(person-has person7 comida)
	(person-has person7 medicina)
	(person-has person8 comida)
	(person-has person9 comida)
))
)

; plan
1. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 0 of 9
2. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 0 of 9
3. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 0 of 9
4. (leave box7 refugio5 dron1-izq dron1 person1 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio5) (free dron1-izq) (person-has person1 comida)
   goals met: 1 of 9
5. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 1 of 9
6. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 1 of 9
7. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 1 of 9
8. (leave box9 refugio9 dron1-der dron1 person3 medicina)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 medicina)
   added: (at-box box9 refugio9) (free dron1-der) (person-has person3 medicina)
   goals met: 2 of 9
9. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 2 of 9
10. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 2 of 9
11. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 2 of 9
12. (move refugio2 refugio6 dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 refugio6)
   goals met: 2 of 9
13. (leave box8 refugio6 dron1-der dron1 person7 medicina)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 medicina)
   added: (at-box box8 refugio6) (free dron1-der) (person-has person7 medicina)
   goals met: 3 of 9
14. (leave box6 refugio6 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio6) (free dron1-izq) (person-has person7 comida)
   goals met: 4 of 9
15. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 4 of 9
16. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 4 of 9
17. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 4 of 9
18. (leave box5 refugio2 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio2) (free dron1-der) (person-has person6 comida)
   goals met: 5 of 9
19. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 5 of 9
20. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 5 of 9
21. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 5 of 9
22. (leave box4 refugio8 dron1-der dron1 person8 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio8) (free dron1-der) (person-has person8 comida)
   goals met: 6 of 9
23. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 6 of 9
24. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 6 of 9
25. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 6 of 9
26. (leave box3 refugio1 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio1) (free dron1-der) (person-has person2 comida)
   goals met: 7 of 9
27. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 7 of 9
28. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 7 of 9
29. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 7 of 9
30. (leave box2 refugio1 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio1) (free dron1-der) (person-has person5 comida)
   goals met: 8 of 9
31. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 8 of 9
32. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 8 of 9
33. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 8 of 9
34. (leave box1 refugio1 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio1) (free dron1-der) (person-has person9 comida)
   goals met: 9 of 9
